#!/usr/bin/env python3
# -*- coding:utf-8 -*-

import pandas as pd
import numpy as np

dates = pd.date_range('20170101', periods=6)
print(dates)
# DatetimeIndex(['2017-01-01', '2017-01-02', '2017-01-03', '2017-01-04',
#                '2017-01-05', '2017-01-06'],
#               dtype='datetime64[ns]', freq='D')
df1 = pd.DataFrame(np.arange(24).reshape((6, 4)), index=dates, columns=['A', 'B', 'C', 'D'])
print(df1)
#              A   B   C   D
# 2017-01-01   0   1   2   3
# 2017-01-02   4   5   6   7
# 2017-01-03   8   9  10  11
# 2017-01-04  12  13  14  15
# 2017-01-05  16  17  18  19
# 2017-01-06  20  21  22  23

print(df1['A'])
# 2017-01-01     0
# 2017-01-02     4
# 2017-01-03     8
# 2017-01-04    12
# 2017-01-05    16
# 2017-01-06    20
# Freq: D, Name: A, dtype: int32

print(df1.A)
# 2017-01-01     0
# 2017-01-02     4
# 2017-01-03     8
# 2017-01-04    12
# 2017-01-05    16
# 2017-01-06    20
# Freq: D, Name: A, dtype: int32

print(df1[0:2])
#             A  B  C  D
# 2017-01-01  0  1  2  3
# 2017-01-02  4  5  6  7

# 通过标签选择数据
print(df1.loc['20170102'])
# A    4
# B    5
# C    6
# D    7
# Name: 2017-01-02 00:00:00, dtype: int32

print(df1.loc['20170102', ['A','C']])
# A    4
# C    6
# Name: 2017-01-02 00:00:00, dtype: int32

print(df1.loc[:,['A','B']])
#              A   B
# 2017-01-01   0   1
# 2017-01-02   4   5
# 2017-01-03   8   9
# 2017-01-04  12  13
# 2017-01-05  16  17
# 2017-01-06  20  21

# 通过位置选择数据
print(df1.iloc[2]) #第二行
# A     8
# B     9
# C    10
# D    11
# Name: 2017-01-03 00:00:00, dtype: int32

print(df1.iloc[1:3, 2:4])
#              C   D
# 2017-01-02   6   7
# 2017-01-03  10  11

print(df1.iloc[[1,2,3],[1,3]])
#              B   D
# 2017-01-02   5   7
# 2017-01-03   9  11
# 2017-01-04  13  15

print(df1.A > 6)
# 2017-01-01    False
# 2017-01-02    False
# 2017-01-03     True
# 2017-01-04     True
# 2017-01-05     True
# 2017-01-06     True
# Freq: D, Name: A, dtype: bool

print(df1[df1.A > 6])
#              A   B   C   D
# 2017-01-03   8   9  10  11
# 2017-01-04  12  13  14  15
# 2017-01-05  16  17  18  19
# 2017-01-06  20  21  22  23

